app/views/networks/index.html.erb

<!-- What user sees if they aren't signed in -->
<% if User.count == 0 %>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"