app/controllers/networks_controller.rb

  def load
    @token = Authorizer.instantiate_token
    @timeline = JSON.parse(@token.get('https://api.twitter.com/1.1/statuses/user_timeline.json?count=200').body)
    @mentions = JSON.parse(@token.get('https://api.twitter.com/1.1/statuses/mentions_timeline.json?count=200').body)
    @user = JSON.parse(@token.get('https://api.twitter.com/1.1/account/verify_credentials.json').body)
    @friends = JSON.parse(@token.get('https://api.twitter.com/1.1/friends/list.json?count=200').body)
    @followers = JSON.parse(@token.get('https://api.twitter.com/1.1/followers/list.json?count=200').body)
    TwitterLoader.create_tweet_objects(@timeline, false)
    TwitterLoader.create_tweet_objects(@mentions, true)
    TwitterLoader.add_user_properties(@user)
    TwitterLoader.create_friends(@friends)
    TwitterLoader.create_followers(@followers)
---
INSERT INTO "tweets" ("created_at", "id_str", "mention", "retweeted", "retweeted_status", "tweet_created_at", "tweet_text", "updated_at", "user_who_posted") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "friends" ("created_at", "screen_name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 26 Aug 2014 04:41:32 UTC +00:00], ["screen_name", "TwitterEng"], ["updated_at", Tue, 26 Aug 2014 04:41:32 UTC +00:00]]
INSERT INTO "followers" ("created_at", "screen_name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 26 Aug 2014 04:41:33 UTC +00:00], ["screen_name", "rjbernaldo"], ["updated_at", Tue, 26 Aug 2014 04:41:33 UTC +00:00]]